/**
 * express 基于 Node.js web 框架应用
 * 封装了一些工具包 便于开发HTTP服务
 */


/**
 * 路由: 应用程序如何响应客户端对特定端点的请求
 * app.method(path, callback)
 */

/**
 * 中间件 Middleware 本质是一个回调函数
 * 中间件可以像路由回调一样访问 request response
 * 
 * 作用: 使用函数封装公共操作, 简化代码
 * 
 * 
 * 全局中间件
 * 路由中间件
 */


/**
 * 静态资源中间件
 * 
 * app.use(express.static(__dirname + '/public))
 * 
 * index.html 默认打开资源
 * 如果静态资源与路由规则同时匹配, 水仙匹配谁就响应
 * 路由响应动态资源, 静态资源中间件响应静态资源
 */


/**
 * 防盗链: 禁止该域名之外的其他网站对资源访问
 * 
 * 原理: 报文 referer 请求头的判断
 */

/**
 * MongoDB 基于分布式文件存储的数据库
 * 1. 数据库: 是一个数据仓库, 数据库服务下可以创建很多数据库, 数据库可以存放很多集合
 * 2. 集合: 集合类似于 js 中的数组, 在集合中可以存放很多文档 (表)
 * 3. 文档: 文档是数据库的最小单位, 类似于 js 中的对象 (行)
 */